/* No comment provided by engineer. */
"error.summary" = "Errore generico. I seguenti campi non sono validi: %@";

"BeNotEmpty.error.message" = "Non può essere vuoto";
"BeNotEmpty.error.message.extended" = "'%1$@' Non può essere vuoto. Fornito: '%2$@'.";

"BeNotNil.error.message" = "Non può essere nil";
"BeNotNil.error.message.extended" = "'%1$@' non può essere nil. Fornito: '%2$@'.";

"BeTrue.error.message" = "Deve essere attivo.";
"BeTrue.error.message.extended" = "%1$@ deve essere attivo. È stato fornito %2$@.";

"GenericRule.error.message" = "Valore errato";
"GenericRule.error.message.extended" = "%1$@ non risulta corretto. È stato fornito %2$@.";

"GreaterThan.error.message" = "Deve essere maggiore di %2$@.";
"GreaterThan.error.message.extended" = "%1$@ deve essere maggiore di %2$@. È stato fornito %3$@.";

"InRange.error.message" = "Deve essere compreso tra %2$@ e %3$@.";
"InRange.error.message.extended" = "%1$@ deve essere compreso tra %2$@ e %3$@. Fornito %4$@";

"LessThan.error.message" = "Deve essere minore di %2$@.";
"LessThan.error.message.extended" = "%1$@ deve essere minore di %2$@. È stato fornito %3$@.";

"RegextMatch.error.message" = "Il valore non è valido.";
"RegextMatch.error.message.extended" = "%1$@ non è valido. È stato fornito %2$@.";

"ValidEmail.error.message" = "Non è un valido indirizzo email.";
"ValidEmail.error.message.extended" = "%1$@ non rispetta il formato di indirizzo email.";

"AbstractValidator.error.message" = "%1$@ è invalido";
"AbstractValidator.error.message.extended" = "%1$@ è invalido";
